---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LightFamily Properties
LightFamily Class See Also Send Feedback
---

The LightFamily type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

LightFamily Class

Autodesk.Revit.DB.Lighting Namespace